app/controllers/sessions_controller.rb

  def show
    session['access_token'] = "3163517532-EhsW9yjxQBoUaUoXJQoHF0779iMvFPywnTJ4MCb"
    session['access_token_secret'] = "1JRSuPN6BKm8ZnwH3HpylY1iJrom5PqqZOutKk0CLhWEg"
    session[:twitter_handle] = "saini_jyotii"
    if session['access_token'] && session['access_token_secret'] && session[:twitter_handle]
      @db_user_obj = User.find_by_twitter_handle(session[:twitter_handle])
      unless @db_user_obj
        @db_user_obj = User.create(
          twitter_handle: session[:twitter_handle],
          access_key: session['access_token'],
          secret_key: session['access_token_secret']
        )
---
SELECT  `users`.* FROM `users` WHERE `users`.`twitter_handle` = 'bknar3ndra' LIMIT 1
INSERT INTO `users` (`twitter_handle`, `access_key`, `secret_key`, `created_at`, `updated_at`) VALUES ('bknar3ndra', '709250762-IBCuFDYKJQ5UCHimBbMOXxtvM5gfGG6ZJ3NwToZv', 'voU70d7QysP6vZG79kmFiLAaYDnWZAmwhW4wqBJxGYIA1', '2016-07-21 19:16:08', '2016-07-21 19:16:08')