app/controllers/welcome_controller.rb

  def index
    if session['access_token'] && session['access_token_secret'] && session[:twitter_handle]
      @db_user_obj = User.find_by_twitter_handle(session[:twitter_handle])
---
SELECT  `users`.* FROM `users` WHERE `users`.`twitter_handle` = 'bknar3ndra' LIMIT 1